tap "hashicorp/tap"
tap "puma/puma"
tap "tkareine/chnode"
brew "xz"
brew "libtiff"
brew "jpeg-xl"
brew "aom"
brew "automake"
brew "readline"
brew "bash"
brew "bison"
brew "ca-certificates"
brew "caddy", restart_service: :changed
brew "glib"
brew "cairo"
brew "chruby"
brew "openssl@3"
brew "curl"
brew "fd"
brew "gcc"
brew "open-mpi"
brew "fzf"
brew "gdbm"
brew "gdk-pixbuf"
brew "gh"
brew "harfbuzz"
brew "pango"
brew "tesseract"
brew "ghostscript"
brew "git"
brew "unbound"
brew "libusb"
brew "gnupg"
brew "gpgme"
brew "netpbm"
brew "python@3.12"
brew "librsvg"
brew "graphviz"
brew "gum"
brew "hdf5"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "jemalloc"
brew "lazygit"
brew "libffi"
brew "libmatio"
brew "libpq"
brew "libsodium"
brew "libyaml"
brew "mint"
brew "mise"
brew "mkcert"
brew "mysql", restart_service: :changed
brew "neovim"
brew "python@3.13"
brew "neovim-remote"
brew "node-build"
brew "nss"
brew "openssl@1.1"
brew "pinentry-mac"
brew "pipx"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "python-setuptools"
brew "python@3.10"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "ruby-install"
brew "rust"
brew "sshpass"
brew "tailspin"
brew "terminal-notifier"
brew "trash", link: true
brew "vips"
brew "yarn"
brew "yt-dlp"
brew "zsh"
brew "zsh-autosuggestions"
brew "hashicorp/tap/nomad"
brew "puma/puma/puma-dev"
brew "tkareine/chnode/chnode"
cask "1password-cli"
cask "chromedriver"
cask "ghostty"
cask "orbstack"
cask "qlmarkdown"
vscode "alexkrechik.cucumberautocomplete"
vscode "aliariff.vscode-erb-beautify"
vscode "bierner.markdown-mermaid"
vscode "castwide.solargraph"
vscode "dae.vscode-mac-color-picker"
vscode "datadog.datadog-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "deerawan.vscode-dash"
vscode "dotenv.dotenv-vscode"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "eskimoblood.create-test"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "ghbozz.hashtag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gurgeous.bust-a-gem"
vscode "hbenl.vscode-test-explorer"
vscode "hridoy.rails-snippets"
vscode "ibm.output-colorizer"
vscode "kaiwood.endwise"
vscode "karunamurti.haml"
vscode "koichisasada.vscode-rdbg"
vscode "lokalise.i18n-ally"
vscode "marcoroth.herb-lsp"
vscode "marcoroth.stimulus-lsp"
vscode "marcoroth.turbo-lsp"
vscode "mechatroner.rainbow-csv"
vscode "mickey.code-copy-ruby-ref"
vscode "miguel-savignano.ruby-symbols"
vscode "mikestead.dotenv"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.test-adapter-converter"
vscode "mtayllan.ruby-run-tests"
vscode "openai.chatgpt"
vscode "orepor.color-tabs-vscode-ext"
vscode "pavlitsky.yard"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "rubocop.vscode-rubocop"
vscode "santoso-wijaya.helios-selene"
vscode "seatonjiang.gitmoji-vscode"
vscode "shanehofstetter.rails-open-partial"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "syler.sass-indented"
vscode "vayan.haml"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wingrunr21.vscode-ruby"
vscode "zignd.html-css-class-completion"
vscode "zombocom.dead-end-vscode"
