# Brewfile.vscode
#
# GENERATED by: ./save.sh
# DO NOT EDIT by hand; your changes will be overwritten the next time you run save.sh.
#
# This Brewfile contains VS Code extensions in Homebrew Bundle format (best-effort).
#
vscode "alexkrechik.cucumberautocomplete"
vscode "aliariff.vscode-erb-beautify"
vscode "bierner.markdown-mermaid"
vscode "castwide.solargraph"
vscode "dae.vscode-mac-color-picker"
vscode "datadog.datadog-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "deerawan.vscode-dash"
vscode "dotenv.dotenv-vscode"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "eskimoblood.create-test"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "ghbozz.hashtag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gurgeous.bust-a-gem"
vscode "hbenl.vscode-test-explorer"
vscode "hridoy.rails-snippets"
vscode "ibm.output-colorizer"
vscode "kaiwood.endwise"
vscode "karunamurti.haml"
vscode "koichisasada.vscode-rdbg"
vscode "lokalise.i18n-ally"
vscode "marcoroth.herb-lsp"
vscode "marcoroth.stimulus-lsp"
vscode "marcoroth.turbo-lsp"
vscode "mechatroner.rainbow-csv"
vscode "mickey.code-copy-ruby-ref"
vscode "miguel-savignano.ruby-symbols"
vscode "mikestead.dotenv"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.test-adapter-converter"
vscode "mtayllan.ruby-run-tests"
vscode "openai.chatgpt"
vscode "orepor.color-tabs-vscode-ext"
vscode "pavlitsky.yard"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "rubocop.vscode-rubocop"
vscode "santoso-wijaya.helios-selene"
vscode "seatonjiang.gitmoji-vscode"
vscode "shanehofstetter.rails-open-partial"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "syler.sass-indented"
vscode "vayan.haml"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wingrunr21.vscode-ruby"
vscode "zignd.html-css-class-completion"
vscode "zombocom.dead-end-vscode"
